name: "ensemble"
platform: "ensemble"

input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
input [
  {
    name: "INPUT1"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
    {
        name: "LOGITS"
        data_type: TYPE_FP32
        dims: [30, 2]
    },
    {
        name: "SPANS"
        data_type: TYPE_FP32
        dims: [30, 2]
    }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess",
      model_version: -1,
      input_map {
        key: "INPUT0"
        value: "INPUT0"
      },
      input_map {
        key: "INPUT1"
        value: "INPUT1"
      },
      output_map {
        key: "video"
        value: "video"
      },
      output_map {
        key: "text"
        value: "text"
      }
    },
    {
      model_name: "clip",
      model_version: -1,
      input_map {
        key: "video"
        value: "video"
      },
      input_map {
        key: "text"
        value: "text"
      },
      output_map {
        key: "video_output"
        value: "clip_vid"
      },
      output_map {
        key: "text_output"
        value: "clip_text"
      }
    },
    {
      model_name: "prepare_core",
      model_version: -1,
      input_map {
        key: "clip_vid"
        value: "clip_vid"
      },
      input_map {
        key: "clip_text"
        value: "clip_text"
      },
      output_map {
        key: "clip_vid"
        value: "clip_vid_prep"
      },
      output_map {
        key: "clip_text"
        value: "clip_text_prep"
      },
      output_map {
        key: "clip_vid_mask"
        value: "clip_vid_mask"
      },
      output_map {
        key: "clip_text_mask"
        value: "clip_text_mask"
      }
    },
    {
      model_name: "core",
      model_version: -1,
      input_map {
        key: "src_vid"
        value: "clip_vid_prep"
      },
      input_map {
        key: "src_txt"
        value: "clip_text_prep"
      },
      input_map {
        key: "src_vid_mask"
        value: "clip_vid_mask"
      },
      input_map {
        key: "src_txt_mask"
        value: "clip_text_mask"
      },
      output_map {
        key: "pred_logits"
        value: "LOGITS"
      },
      output_map {
        key: "pred_spans"
        value: "SPANS"
      }
    }
  ]
}